Table of Contents
 Class ParameterReferenceElement
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Reference element parameter of cross-section
public class ParameterReferenceElement : Parameter
Inheritance
object
OpenObject
Parameter
ParameterReferenceElement
Inherited Members
 Parameter.Name
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Value
Value
public ReferenceElement Value { get; set; }
Property Value
ReferenceElement
 Edit this page